# IntersectionResult Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
IntersectionResult Constructor
IntersectionResult Class See Also
---
Initializes a new instance of the IntersectionResult class
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public IntersectionResult()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
IntersectionResult()
```

# See Also
IntersectionResult Class
Autodesk.Revit.DB Namespace